loadtests/n8n-test.yaml
config:
  target: http://localhost:5678/webhook
  phases:
      # The following example creates 20 virtual users in 60 seconds (one virtual user approximately every 3 seconds):
      # duration 60 sec
      # read more https://www.artillery.io/docs/reference/test-script
    - duration: 60
      # 20 virtual users
      arrivalRate: 20
      name: "20 tps"
      # pause 60 sec for clear req
    - pause: 60
      name: "waiting"
      # duration 60 sec
    - duration: 60
      # 25 virtual users
      arrivalRate: 25
      name: "25 tps"
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 100
  ensure:
      thresholds:
        - http.response_time.p99: 100
        - http.response_time.p95: 75
        
scenarios:
  - flow:
      # http method
      - get:
          # endpoint
          url: "/load"