loadtests/n8n-test.yaml
config:
  # This is a test server run by team Artillery
  # It's designed to be highly scalable
  target: http://localhost:5678/webhook
  phases:
    - duration: 60
      arrivalRate: 20
      name: "20 tps"
    - pause: 60
      name: "waiting"
    - duration: 60
      arrivalRate: 25
      name: "25 tps"
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 100
  ensure:
      thresholds:
        - http.response_time.p99: 100
        - http.response_time.p95: 75
scenarios:
  - flow:
      - get:
          url: "/load"